In [1]:
import pandas as pd
from sqlalchemy import create_engine 
from sqlalchemy.orm import Session

In [2]:
# Updated reference for unemployment data:
# OECD (2021), Unemployment rate (indicator). doi: 10.1787/52570002-en (Accessed on 07 August 2021)
# Definition of Unemployment rate
# The unemployed are people of working age who are without work, are available for work, and have taken specific steps to find work. The uniform application of this definition results in estimates of unemployment rates that are more internationally comparable than estimates based on national definitions of unemployment. This indicator is measured in numbers of unemployed people as a percentage of the labour force and it is seasonally adjusted. The labour force is defined as the total number of unemployed people plus those in employment. Data are based on labour force surveys (LFS).  For European Union countries where monthly LFS information is not available, the monthly unemployed figures are estimated by Eurostat.

In [4]:
csv_file_unemp ="../group_project_2_copy/Resources/unemployment.csv"
unemployment_raw_df= pd.read_csv(csv_file_unemp)
unemployment_raw_df.head()

  LOCATION INDICATOR SUBJECT MEASURE FREQUENCY  TIME  Value Flag Codes
0      AUS       HUR     TOT   PC_LF         A  1967  1.875        NaN
1      AUS       HUR     TOT   PC_LF         A  1968  1.850        NaN
2      AUS       HUR     TOT   PC_LF         A  1969  1.800        NaN
3      AUS       HUR     TOT   PC_LF         A  1970  1.625        NaN
4      AUS       HUR     TOT   PC_LF         A  1971  1.925        NaN

In [4]:
# https://data.oecd.org/emp/employment-rate.htm
## OECD (2021), Employment rate (indicator). doi: 10.1787/1de68a9b-en (Accessed on 07 August 2021)
# Definition of Employment rate
# Employment rates are defined as a measure of the extent to which available labour resources (people available to work) are being used. They are calculated as the ratio of the employed to the working age population. Employment rates are sensitive to the economic cycle, but in the longer term they are significantly affected by governments' higher education and income support policies and by policies that facilitate employment of women and disadvantaged groups. Employed people are those aged 15 or over who report that they have worked in gainful employment for at least one hour in the previous week or who had a job but were absent from work during the reference week. The working age population refers to people aged 15 to 64. This indicator is seasonally adjusted and it is measured in terms of thousand persons aged 15 and over; and in numbers of employed persons aged 15 to 64 as a percentage of working age population.

In [5]:
csv_file_emp ="../group_project_2_copy/Resources/employment.csv"
employment_raw_df= pd.read_csv(csv_file_emp)
employment_raw_df.head()

  LOCATION INDICATOR SUBJECT    MEASURE FREQUENCY  TIME     Value Flag Codes
0      AUS       EMP     TOT  PC_WKGPOP         A  1979  64.38335        NaN
1      AUS       EMP     TOT  PC_WKGPOP         A  1980  65.17445        NaN
2      AUS       EMP     TOT  PC_WKGPOP         A  1981  65.36742        NaN
3      AUS       EMP     TOT  PC_WKGPOP         A  1982  64.16441        NaN
4      AUS       EMP     TOT  PC_WKGPOP         A  1983  61.94022        NaN

In [6]:
rds_connection_string = "<username>:<password>@localhost:5432/stock_exchange"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [8]:
unemployment_raw_df.to_sql(name='raw_unemployment', con=engine, if_exists='append', index=True,index_label='id')

In [9]:
employment_raw_df.to_sql(name='raw_employment', con=engine, if_exists='append', index=True, index_label='id')

In [10]:
engine.table_names()

['indexinfo', 'indexdata', 'raw_unemployment', 'raw_employment']

In [11]:
pd.read_sql_query(f'select * from raw_unemployment', con=engine).head()

   id LOCATION INDICATOR SUBJECT MEASURE FREQUENCY  TIME  Value Flag Codes
0   0      AUS       HUR     TOT   PC_LF         A  1967  1.875       None
1   1      AUS       HUR     TOT   PC_LF         A  1968  1.850       None
2   2      AUS       HUR     TOT   PC_LF         A  1969  1.800       None
3   3      AUS       HUR     TOT   PC_LF         A  1970  1.625       None
4   4      AUS       HUR     TOT   PC_LF         A  1971  1.925       None

In [12]:
pd.read_sql_query(f'select * from raw_employment', con=engine).head()

,id,LOCATION,INDICATOR,SUBJECT,MEASURE,FREQUENCY,TIME,Value,Flag Codes
0,0,AUS,EMP,TOT,PC_WKGPOP,A,1979,64.38335,None
1,1,AUS,EMP,TOT,PC_WKGPOP,A,1980,65.17445,None
2,2,AUS,EMP,TOT,PC_WKGPOP,A,1981,65.36742,None
3,3,AUS,EMP,TOT,PC_WKGPOP,A,1982,64.16441,None
4,4,AUS,EMP,TOT,PC_WKGPOP,A,1983,61.94022,None

In [16]:
# keeping the countries relevant to our stock exchanges
query1="""select * from raw_unemployment where "LOCATION" = 'USA' OR "LOCATION" = 'CAN' OR "LOCATION" = 'CHE' OR "LOCATION" = 'DEU' OR "LOCATION" = 'JPN' OR "LOCATION" = 'KOR' OR "LOCATION" = 'EA19' OR "LOCATION" = 'EU27_2020'"""
unemp_clean_df=pd.read_sql_query(query1, con=engine)

In [17]:
unemp_clean_df

,id,LOCATION,INDICATOR,SUBJECT,MEASURE,FREQUENCY,TIME,Value,Flag Codes
0,117,CAN,HUR,TOT,PC_LF,A,1955,4.408333,None
1,118,CAN,HUR,TOT,PC_LF,A,1956,3.433333,None
2,119,CAN,HUR,TOT,PC_LF,A,1957,4.650000,None
3,120,CAN,HUR,TOT,PC_LF,A,1958,7.066667,None
4,121,CAN,HUR,TOT,PC_LF,A,1959,5.991667,None
...,...,...,...,...,...,...,...,...,...
309,1306,EU27_2020,HUR,TOT,PC_LF,A,2015,10.075000,None
310,1307,EU27_2020,HUR,TOT,PC_LF,A,2016,9.175000,None
311,1308,EU27_2020,HUR,TOT,PC_LF,A,2017,8.175000,None
312,1309,EU27_2020,HUR,TOT,PC_LF,A,2018,7.300000,None
313,1310,EU27_2020,HUR,TOT,PC_LF,A,2019,6.733333,None

In [18]:
unemp_clean_df.to_sql(name='unemp_clean', con=engine, if_exists='append', index=False)

In [19]:
# keeping the countries relevant to our stock exchanges
query2="""select * from raw_employment where "LOCATION" = 'USA' OR "LOCATION" = 'CAN' OR "LOCATION" = 'CHE' OR "LOCATION" = 'DEU' OR "LOCATION" = 'JPN' OR "LOCATION" = 'KOR' OR "LOCATION" = 'EA19' OR "LOCATION" = 'EU27_2020' OR "LOCATION" = 'ZAF'"""
emp_clean_df=pd.read_sql_query(query2, con=engine)

In [20]:
emp_clean_df

,id,LOCATION,INDICATOR,SUBJECT,MEASURE,FREQUENCY,TIME,Value,Flag Codes
0,86,CAN,EMP,TOT,PC_WKGPOP,A,1995,67.52500,None
1,87,CAN,EMP,TOT,PC_WKGPOP,A,1996,67.35000,None
2,88,CAN,EMP,TOT,PC_WKGPOP,A,1997,67.98333,None
3,89,CAN,EMP,TOT,PC_WKGPOP,A,1998,68.95000,None
4,90,CAN,EMP,TOT,PC_WKGPOP,A,1999,69.98333,None
...,...,...,...,...,...,...,...,...,...
246,952,EU27_2020,EMP,TOT,PC_WKGPOP,A,2016,65.57500,None
247,953,EU27_2020,EMP,TOT,PC_WKGPOP,A,2017,66.72500,None
248,954,EU27_2020,EMP,TOT,PC_WKGPOP,A,2018,67.65000,None
249,955,EU27_2020,EMP,TOT,PC_WKGPOP,A,2019,68.40000,None
250,956,EU27_2020,EMP,TOT,PC_WKGPOP,A,2020,67.62500,B

In [21]:
emp_clean_df.to_sql(name='emp_clean', con=engine, if_exists='append', index=False)

In [22]:
# creating dictionary key to map countries listed in indexInfo
conversion_dict = {
    'Country': ['Canada', 'China', 'Euro Area-19 (2015 to present)', 'European Union 27', 'Germany', 'Hong Kong', 'India', 'Japan', 'Korea', 'South Africa', 'Switzerland', 'Taiwan', 'United States'], # this is standard country or group names (few different Euro groups got dates of those from googling)
    'Job_Loc': ['CAN', 'na', 'EA19', 'EU27-2020', 'DEU', 'na', 'na', 'JPN', 'KOR', 'ZAF', 'CHE', 'na', 'USA' ], # this is the abbreviation from jobs files (i.e., emp & unemp)
    'Stock_Region': ['Canada', 'China', 'Europe', 'Europe', 'Germany', 'Hong Kong', 'India', 'Japan', 'Korea', 'South Africa', 'Switzerland', 'Taiwan', 'United States'], # this is Region from indexInfo
    'Unemp': [True, False, True, True, True, False, False, True, True, False, True, False, True], # boolean
    'Emp': [True, False, True, True, True, False, False, True, True, True, True, False, True] # boolean 
}

In [24]:
conversion_df=pd.DataFrame.from_dict(conversion_dict)

In [25]:
conversion_df

                           Country    Job_Loc   Stock_Region  Unemp    Emp
0                           Canada        CAN         Canada   True   True
1                            China         na          China  False  False
2   Euro Area-19 (2015 to present)       EA19         Europe   True   True
3                European Union 27  EU27-2020         Europe   True   True
4                          Germany        DEU        Germany   True   True
5                        Hong Kong         na      Hong Kong  False  False
6                            India         na          India  False  False
7                            Japan        JPN          Japan   True   True
8                            Korea        KOR          Korea   True   True
9                     South Africa        ZAF   South Africa  False   True
10                     Switzerland        CHE    Switzerland   True   True
11                          Taiwan         na         Taiwan  False  False
12                   United States        USA  United States   True   True

In [31]:
conversion_df.to_sql(name='geomatching', con=engine, if_exists='append', index=False)